<div class="content">
	<p><i> Завдання 1</i><br>
		У форму вводиться число N. Знайти всі досконалі числа до N.
	Досконале число - це таке число, що дорівнює сумі всіх своїх дільників,
	крім себе самого. Наприклад, число 6 є досконалим, тому що крім себе
	самого ділиться на числа 1, 2 і 3, які в сумі дають 6.</p>
	<p><i> Завдання 2</i><br>
		У форму вводиться текст, слова в якому розділені пробілами і
	розділовими знаками. Вилучити з цього тексту всі слова найбільшої
	довжини. (Слів найбільшої довжини може бути декілька).</p>
	<p><i> Завдання 3</i><br>
		Вводяться N натуральних чисел більше 2. Підрахувати, скільки серед
	них простих чисел.</p>
	<p><i> Завдання 4</i><br>
		Політичне життя однієї країни дуже жваве. У країні діє K політичних
	партій, кожна з яких регулярно оголошує національний страйк. Дні, коли
	хоча б одна з партій оголошує страйк, за умови, що це не субота або неділя
	(коли і так ніхто не працює), завдають великої шкоди економіці країни.
	i-та партія оголошує страйки строго кожні bi днів, починаючи з дня з
	номером ai. Тобто i-та партія оголошує страйки в дні ai, ai + bi, ai + 2bi і т.д.
		Якщо в якийсь день кілька партій оголошує страйк, то це вважається
	загальнонаціональним страйком.
		У календарі країни N днів, пронумерованих від 1 до N. Перший день
	року є понеділком, шостий і сьомий дні року - вихідні, тиждень складається
	з семи днів.</p>
	<p><i> Завдання 5</i><br>
		Задано текст. Словом вважається послідовність непробільних символів,
	які йдуть підряд. Слова розділені одним або більшим числом пробілів або
	символами кінця рядка.
		Для кожного слова з цього тексту підрахуйте, скільки разів воно
	зустрічалося в цьому тексті раніше. Використайте словники.</p>
	<p><i> Завдання 6</i><br>
		Змагання з гри «Тетріс-онлайн» проводяться за такими правилами:
	Кожен учасник реєструється на сайті гри під певним ігровим ім'ям. Імена
	учасників не повторюються.
		Чемпіонат проводиться протягом певного часу. У будь-який момент цього
	часу будь-який зареєстрований учасник може зайти на сайт чемпіонату і
	почати залікову гру. Після закінчення гри її результат (кількість балів)
	фіксується і заноситься до протоколу.
		Учасники мають право грати кілька разів. Кількість спроб одного учасника
	не обмежується. Остаточний результат учасника визначається по одній грі,
	кращою для даного учасника. Більш високе місце в змаганнях займає
	учасник, що показав кращий результат. При рівності результатів більш
	високе місце займає учасник, раніше показав кращий результат.
	В ході змагань заповнюється протокол, кожен рядок якого описує одну гру
	і містить результат учасника і його ігрове ім'я. Протокол формується в
	реальному часі по ходу проведення чемпіонату, тому рядки в ньому
	розташовані в порядку проведення ігор: чим раніше зустрічається рядок у
	протоколі, тим раніше закінчилася відповідна цьому рядку гра.
		Напишіть програму, яка за даними протоколу визначає переможця і
	призерів. Гарантується, що в чемпіонаті бере участь не менше трьох гравців.</p>
</div>
	