<div class="content">
	<p>
		<i> 
			Завдання 6
		</i>
		<p>
				Змагання з гри «Тетріс-онлайн» проводяться за такими правилами:
			Кожен учасник реєструється на сайті гри під певним ігровим ім'ям. Імена
			учасників не повторюються.
		</p>
		<p>  Чемпіонат проводиться протягом певного часу. У будь-який момент цього
			часу будь-який зареєстрований учасник може зайти на сайт чемпіонату і
			почати залікову гру. Після закінчення гри її результат (кількість балів)
			фіксується і заноситься до протоколу.
		</p>
		<p>
				Учасники мають право грати кілька разів. Кількість спроб одного учасника
			не обмежується. Остаточний результат учасника визначається по одній грі,
			кращою для даного учасника. Більш високе місце в змаганнях займає
			учасник, що показав кращий результат. При рівності результатів більш
			високе місце займає учасник, раніше показав кращий результат.
			В ході змагань заповнюється протокол, кожен рядок якого описує одну гру
			і містить результат учасника і його ігрове ім'я. Протокол формується в
			реальному часі по ходу проведення чемпіонату, тому рядки в ньому
			розташовані в порядку проведення ігор: чим раніше зустрічається рядок у
			протоколі, тим раніше закінчилася відповідна цьому рядку гра.
		</p>
		<p>
				Напишіть програму, яка за даними протоколу визначає переможця і
			призерів. Гарантується, що в чемпіонаті бере участь не менше трьох гравців.
		</p>
	</p>
	<form id="form1" name="form1" method="post" action="">					
		<p>
			<textarea name="matr" form="form1"></textarea>
		</p>
		<p>
		<input type="submit" name="task6" id="faind" value="Підрахувати" />
		</p>			
	</form>
	<?php
		if(isset($_POST['matr']) && !empty($_POST['matr'])){
			$mat = split("\n",$_POST['matr']); 
			for ($i = 1; $i < count($mat); $i++){
				$mat[$i] = split(" ",$mat[$i]);
			}
			$n = intval($mat[0]);
			for ($i = 1; $i <= $n; $i++){
				$mat[$i][0] = intval($mat[$i][0]);
				for ($j = 1; $j <= $n; $j++){
					if (($mat[$j][1] == $mat[$i][1]) && ($j != $i)){
						
						if ($mat[$j][0] > $mat[$i][0]){
							$mat[$i][0] = 0;
						}else if ($mat[$j][0] < $mat[$i][0]){
									$mat[$j][0] = 0;
								}else if($i > $j){
									$mat[$i][0] = 0;
								}else $mat[$j][0] = 0;
					}
				}
			}
			$max = 0;
			for ($i = 1; $i <= $n; $i++){
				if ($max < $mat[$i][0]){
					$max = $mat[$i][0];
				}
			}
			for ($i = 1; $i <= $n; $i++){
				if ($max == $mat[$i][0]){
					$nam = $mat[$i][1];
					$znach = $mat[$i][0];
					echo "1 місце : $nam ($znach)<br>";
					$mat[$i][0] = 0;
					break;
				}
			}
			$max = 0;
			for ($i = 1; $i <= $n; $i++){
				if ($max < $mat[$i][0]){
					$max = $mat[$i][0];
				}
			}
			for ($i = 1; $i <= $n; $i++){
				if ($max == $mat[$i][0]){
					$nam = $mat[$i][1];
					$znach = $mat[$i][0];
					echo "2 місце : $nam ($znach)<br>";
					$mat[$i][0] = 0;
					break;
				}
			}
			$max = 0;
			for ($i = 1; $i <= $n; $i++){
				if ($max < $mat[$i][0]){
					$max = $mat[$i][0];
				}
			}
			for ($i = 1; $i <= $n; $i++){
				if ($max == $mat[$i][0]){
					$nam = $mat[$i][1];
					$znach = $mat[$i][0];
					echo "3 місце : $nam ($znach)";
					$mat[$i][0] = 0;
					break;
				}
			}			
		}
	?>	
</div>