<div class="content">
	&nbsp;&nbsp;&nbsp;Гантюк В'ячеслав Костянтинович
	<p><i>Освіта:</i><br>
	&nbsp;&nbsp;&nbsp2001 – 2013 Хряцька НВК середня базова освіта
	<br>&nbsp;&nbsp;&nbsp2013 –на даний момент навчаюся в Буковинському 
	державному фінансово-економічному  Університеті, Факультет комп’ютерних 
	і соціальних технологій , спеціальність комп’ютерні науки.
	<br>&nbsp;&nbsp;&nbsp2013 – по сьогоднішній день Чернівецький 
	Національний Університет ім. Юрія Федьковича , факультет математики 
	і інформатики , спеціальність прикладна математика </p>
	<p><i>Додаткова освіта:</i>
	<br>&nbsp;&nbsp;&nbsp2011-2013 Буковинська мала академія при ЧНУ , спеціальність прикладна математика 
	<br>&nbsp;&nbsp;&nbsp2012- курси англійської мови при БДФЕУ</p>
	<p><i>Досвід роботи:</i>
	<br>&nbsp;&nbsp;&nbspНема</p>
	<p><i>Мови програмування:</i> 
	<br>&nbsp;&nbsp;&nbspС++ - вільно, , html – вільно, php – базовий рівень,
	Java – базовий рівень.</p>


</div>